Revit 2027 API
SplitButtonData Constructor
Constructs a new instance of SplitButtonData.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SplitButtonData(
	string name,
	string text
)
Public Sub New (
	name As String,
	text As String
)
public:
SplitButtonData(
	String^ name,
	String^ text
)
new :
        name : string *
        text : string -> SplitButtonData
Parameters
name String
The internal name of the new button.
text String
Exceptions
Exception | Condition
ArgumentNullException | Thrown when null is passed for one or more arguments.
ArgumentException | Thrown when an empty string is passed for one or more arguments.
Remarks
 This text will be displayed on the button if drop-down is empty. If sub-items are added, then the split button will display the current PushButton's text.
See Also
Reference
SplitButtonData Class
Autodesk.Revit.UI Namespace